Table of Contents
 Class CheckSection
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Check section base class
public abstract class CheckSection : OpenElementId
Inheritance
object
OpenObject
OpenElementId
CheckSection
Derived
StagedCheckSection
StandardCheckSection
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 CheckSection()
Constructor
protected CheckSection()
Properties
 CheckMember
CheckMember
public ReferenceElement CheckMember { get; set; }
Property Value
ReferenceElement
 Description
Description of this section
public string Description { get; set; }
Property Value
string
 Extremes
Section extremes
public List<CheckSectionExtreme> Extremes { get; set; }
Property Value
List<CheckSectionExtreme>
 ReinfSection
Reinforcement of cross-section
public ReferenceElement ReinfSection { get; set; }
Property Value
ReferenceElement
 Edit this page